#include <stdio.h> // เรียกใช้ไลบรารีมาตรฐานสำหรับ input/output

int main() { // จุดเริ่มต้นของโปรแกรม

    printf("a =   0 . 6 1 7 %%\n");  // แสดงค่า a เท่ากับ 0.617 ตามด้วยเครื่องหมาย %
    
    printf("b =    2 5 %%\n"); // แสดงค่า b เท่ากับ 25 ตามด้วยเครื่องหมาย %

    printf("c = 1 9 . 0 0 0 %%\n"); // แสดงค่า c เท่ากับ 19.000 ตามด้วยเครื่องหมาย %

    printf("d =    9 %%\n"); // แสดงค่า d เท่ากับ 9 ตามด้วยเครื่องหมาย %

    printf("e = 1 2 4 . 5 5 5 %%\n"); // แสดงค่า e เท่ากับ 124.555 ตามด้วยเครื่องหมาย %

    printf("f = 0 . 0 0 0 1 %%\n"); // แสดงค่า f เท่ากับ 0.0001 ตามด้วยเครื่องหมาย %

    return 0; // จบโปรแกรมโดยส่งค่ากลับ 0 เท่านั้น
}